ring_fountain/base_case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
  \\    /   O peration     | Version:  12
   \\  /    A nd           | Website:  www.openfoam.com
    \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Scaling factor (convert to meters)
scale 1.0;

// Domain dimensions (cylindrical domain)
// Diameter: 0.5 m, Height: 1.0 m
// Water depth: 0.5 m (bottom half), Air: 0.5 m (top half)

// Vertices of a rectangular box (simplified cylindrical domain)
vertices
(
    // Bottom layer (z = 0)
    (-0.25 -0.25 0)    // 0
    ( 0.25 -0.25 0)    // 1
    ( 0.25  0.25 0)    // 2
    (-0.25  0.25 0)    // 3

    // Middle layer (z = 0.5, water surface)
    (-0.25 -0.25 0.5)  // 4
    ( 0.25 -0.25 0.5)  // 5
    ( 0.25  0.25 0.5)  // 6
    (-0.25  0.25 0.5)  // 7

    // Top layer (z = 1.0)
    (-0.25 -0.25 1.0)  // 8
    ( 0.25 -0.25 1.0)  // 9
    ( 0.25  0.25 1.0)  // 10
    (-0.25  0.25 1.0)  // 11
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (10 10 20) simpleGrading (1 1 1)   // Water region (block 0)
    hex (4 5 6 7 8 9 10 11) (10 10 20) simpleGrading (1 1 1) // Air region (block 1)
);

edges
(
);

boundary
(
    // Bottom wall (tank bottom) - block 0 only
    bottom
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }

    // Top boundary (atmosphere) - block 1 only
    atmosphere
    {
        type patch;
        faces
        (
            (8 9 10 11)
        );
    }

    // Side walls - each side split into water and air parts
    walls
    {
        type wall;
        faces
        (
            // x = -0.25 (water: z=0~0.5, air: z=0.5~1.0)
            (0 3 7 4)
            (4 7 11 8)
            // x = 0.25
            (1 2 6 5)
            (5 6 10 9)
            // y = -0.25
            (0 1 5 4)
            (4 5 9 8)
            // y = 0.25
            (3 2 6 7)
            (7 6 10 11)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //