ring_fountain/base_case/constant/sixDoFRigidBodyMotion/restraints
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/sixDoFRigidBodyMotion";
    object      restraints;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Gravity restraint
gravity
{
    type            gravity;
    g               (0 0 -9.81);
}

// Optional: linear damper for stabilization
// linearDamper
// {
//     type            linearDamper;
//     coeff           0.1;
// }

// Optional: angular damper for stabilization
// angularDamper
// {
//     type            angularDamper;
//     coeff           0.1;
// }

// ************************************************************************* //