ring_fountain/base_case/constant/sixDoFRigidBodyMotion/state
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/sixDoFRigidBodyMotion";
    object      state;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Initial center of mass position [m]
centreOfMass    (0 0 0.55);

// Initial orientation (rotation tensor)
// Identity matrix = no rotation
orientation     (1 0 0 0 1 0 0 0 1);

// Initial velocity [m/s]
// Falling with velocity from height H = 0.2 m
// v = sqrt(2*g*H) = sqrt(2*9.81*0.2) = 1.98 m/s
velocity        (0 0 -1.98);

// Initial angular velocity [rad/s]
omega           (0 0 0);

// Mass of the ring [kg]
// For steel ring: density ~ 7850 kg/m³
// Volume = π*(R_outer² - R_inner²)*width
// R_outer = 0.05 m, R_inner = 0.045 m, width = 0.01 m
// Volume = π*(0.05² - 0.045²)*0.01 = π*(0.0025 - 0.002025)*0.01 = π*0.000475*0.01 = 1.49e-5 m³
// Mass = 7850 * 1.49e-5 = 0.117 kg
mass            0.117;

// Moment of inertia [kg·m²]
// For a thin ring: I = m * R² (for rotation about central axis)
// Using average radius: R_avg = (0.05 + 0.045)/2 = 0.0475 m
// I = 0.117 * (0.0475²) = 0.117 * 0.002256 = 2.64e-4 kg·m²
momentOfInertia (2.64e-4 2.64e-4 2.64e-4);

// Center of mass of the undeformed body
// Same as initial position for simplicity
centreOfMass0   (0 0 0.55);

// Orientation of the undeformed body
orientation0    (1 0 0 0 1 0 0 0 1);

// Initial acceleration [m/s²] (optional)
acceleration    (0 0 0);

// Initial angular acceleration [rad/s²] (optional)
alpha           (0 0 0);

// Report settings
report          on;
reportToFile    on;

// Relaxation factor for acceleration (0-1)
accelerationRelaxation 0.9;

// Damping factor for acceleration (0-1)
accelerationDamping    0.95;

// ************************************************************************* //