ring_fountain/base_case/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
   \\  /    A nd           | Version:  12
    \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 4;

method          scotch;

simpleCoeffs
{
    n           (2 2 1);
    delta       0.001;
}

hierarchicalCoeffs
{
    n           (2 2 1);
    delta       0.001;
    order       xyz;
}

manualCoeffs
{
    dataFile    "";
}

distributed     no;

roots           ( );

// ************************************************************************* //