ring_fountain/base_case/system/setFieldsDict.zoneID
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
   \\  /    A nd           | Version:  12
    \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict.zoneID;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue zoneID 0
);

regions
(
    cellToCell
    {
        set ringCells;  // topoSet创建的cellSet
        fieldValues
        (
            volScalarFieldValue zoneID 1
        );
    }
);

// ************************************************************************* //
