ring_fountain/base_case/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
   \\  /    A nd           | Version:  12
    \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // Create cell set for the ring region using STL surface
    {
        name    ringCells;
        type    cellSet;
        action  new;
        source  surfaceToCell;
        sourceInfo
        {
            file "constant/triSurface/ring.stl";
            outsidePoints ((0 0 0.5));
            includeCut false;
            includeInside true;
            includeOutside false;
            nearDistance 0.1;
            curvature 100;
        }
    }

    // Create cell zone from cell set
    {
        name    ringZone;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set ringCells;
        }
    }
);

// ************************************************************************* //